[{
  "_id": {
    "$oid": "6213948c74e9919dfe2cb359"
  },
  "title": "In conversation with David Cheney",
  "slug": "in-conversation-with-david-cheney",
  "description": "<p>Continuing our series of interviews with Abstract Art Canada’s artists, we’d like you to meet David Cheney, Albertan painter and bibliophile. David tells us about his artistic beginnings, his inspirations and his views on abstract art.</p>\r\n<h4>DAVID’S BACKGROUND</h4>\r\n<p><strong>Aimee: When and who or what inspired you to start painting? (a person, place, event, etc)</strong></p>\r\n<p><strong>David: </strong>I drew a lot as a kid. My mother was a strong supporter of my talent but she encouraged me to be trained in something that would pay the bills. I took drafting at South Alberta Institute of Technology (SAIT) and after working for a year, applied for art college. My parents were supportive because I would take commercial art (to pay the bills).</p>\r\n<p>After a year of that program, I won a scholarship and went on an art history trip to Egypt, Greece and England (1982). It was a great experience as I had never travelled before. Now I had a head full of ideas.</p>\r\n<p>Yet the real eye-opener was sitting in the Rothko Chapel at the Tate, London. I was so moved by the paintings that I couldn’t leave. While I was there, the room was closed off while the first retrospective works of a new artist were being hung. I overheard the conversation of the artist – he talked boldly and I was intrigued. The poster of his show was being sold in the gift shop so I bought it and it hung in my studio for many years. The artist was Julian Schnabel.</p>\r\n<p>On the plane ride home, I ran into one of the professors from the art history trip, Bill MacDonnell. We chatted at length about my thoughts on becoming an artist. He suggested that I should switch to painting; adding that I could always continue commercial art to pay my way. He was right. I graduated as an artist, relied on my drafting job and later my work as a graphic designer, for income, and through the years, was able to continue creating my own art.</p>\r\n<h4>DAVID’S PAINTING STYLE</h4>\r\n<p><strong>Aimee: Has your style always been abstract or has it changed or developed over time?</strong></p>\r\n<p><strong>David:</strong> No. In the 1980s, the art scene was fuelled by neo-expressionism. In addition to Julian Schnabel, I was inspired by Francesco Clemente and Anselm Kiefer to create large-scale oil paintings, adding a variety of elements like wood and vases.</p>\r\n<p></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645449323/richtext/rvguhkztfamfrmszulwi.jpg\" alt=\"David’s art materials\" style=\"height: auto;width: 240px\"/></div>\r\n<p>Another big inspiration for me was Robert Motherwell. My first art show at the college in 1983 was directly inspired by his work. His use of collage and free-flowing brushwork was so creative to me. Yet I never felt I could paint that freely and went through a variety of styles from realism to expressionism. I only came to abstraction in the last five years or so. However, getting to abstraction I needed a new medium.</p>\r\n<p>In 1987 I won a grant to study at a small art school in Greece and I was taught watercolour. The real joy of watercolour is the loose, spontaneous brush strokes. Over the years I kept painting in watercolour, often painting images whenever I travelled. On one trip to Mexico, instead of painting the scenery, I just let the colours play. It was so invigorating. I felt truly free, after almost thirty years of painting.</p>\r\n<p><strong>Aimee: How would you sum up your style of art?</strong></p>\r\n<p><strong>David:</strong> I would describe it as loose brush strokes with collage and ink applications. I’m not sure how to describe this other than ‘mixed media’.</p>\r\n<p><strong>Aimee: For those of us new to the world of abstract art, could you give your own interpretation of what abstract painting is?</strong></p>\r\n<p><strong>David:</strong> abstraction is about spontaneous, loose and vivid brush strokes or it can be calculated, tight, washed-out imagery. The realm is wide. Abstraction, in the formal sense, can mean derived from an idea. However, in the creative sense, it really is up to the individual artist and what drives or inspires them. There is a lot of good stuff out there right now.</p>\r\n<h4>DAVID’S INSPIRATION</h4>\r\n<p><strong>Aimee: Which artists inspire you?</strong></p>\r\n<p><strong>David:</strong> Over the years I have seen a lot of art and I can take cues from many sources. In addition to Motherwell and Rothko I also love the work of Howard Hodgkin, David Hockney, Richard Diebenkorn and John Singer Sargent. Then there’s German expressionism, Der Blau Reiter, the Mexican muralistas (Rivera, Siqueiros, Orozco), van Gogh, Matisse, and of course, Picasso.</p>\r\n<p></p>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645449657/richtext/wd5mpzi61gmr52rhejbi.jpg\" alt=\"David with his foreign literature\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>Aimee: What else inspires you?</strong></p>\r\n<p><strong>David:</strong> Actually, reading probably inspires me more than art. I have been an avid reader since my twenties. I read obsessively and fairly widely. I started with English literature (Graham Greene was my favourite) and have since moved on to Latin American novels by Marquez, Vasquez and Vargas Llosa.</p>\r\n<p>Often images or ideas form in my head from a book and I have always used my art to express myself. I am not trying to illustrate books, rather it’s more a reaction – good, bad or indifferent.</p>\r\n<p></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645449781/richtext/luiito1r7xyh1oapkxeg.jpg\" alt=\"Sixteenth Century Andalusian Love\" style=\"height: auto;width: 240px\"/></div>\r\n<p>During the pandemic, I read Don Quixote by Cervantes and In Search of Lost Time by Proust. They inspired several of my artworks. I have four pieces that reflect these two books The Strange and Watery Crossing of the Ebro, Sixteenth Century Andalusian Love Sonnets and Other Rubbish, Looking for Dulcinea of Toboso by the Knight of the Sad Figure, Le Temps Retrouvé and Albertine Disparue.</p>\r\n<h4>DAVID’S CREATIVE PROCESS</h4>\r\n<p><strong>Aimee: Regarding your creative process, are you able to plan ahead or can inspiration strike without warning?</strong></p>\r\n<p><strong>David: </strong>Regarding the abstract collages, it usually happens out of the blue. I don’t plan ahead. I just go to the studio in my house and let it happen. Sometimes a colour will evoke a mood or feeling, then I grab some collage material and then ‘connect’ things.</p>\r\n<p><strong>Aimee: Are there certain set stages? For example, do you decide or know in advance the size of piece, portrait or landscape, canvas or paper, materials etc.</strong></p>\r\n<p><strong>David: </strong>No. The only thing that I plan is the size of the paper, typically 11” x 14”. I work in Pentallic Field books which consist of loose sheets of acid-free paper that is strong enough to handle the various mediums such as watercolour, ink and collage materials.</p>\r\n<p><strong>Aimee: Do you always paint in the same place?</strong></p>\r\n<p><strong>David: </strong>In the pre-pandemic days, I always took art books or watercolour blocks wherever I travelled. I painted anywhere where I could document and record images. I also have a studio where I create larger oil paintings.</p>\r\n<p><strong>Aimee: How long does a painting take or does it vary a lot?</strong></p>\r\n<p><strong>David: </strong>Generally no more than about thirty minutes.</p>\r\n<p><strong>Aimee: How do you know when you’ve finished a piece? Do you go back over it and change or correct it?</strong></p>\r\n<p></p>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645450089/richtext/gf1ftjicjwgic0mpvc7f.jpg\" alt=\"Buscando Las Muralistas, José\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>David: </strong>I usually know once I feel happy with it. Sometimes, I will add something to the piece to ‘tweak’ and on occasion, I just tear it up (although I usually keep the pieces and add them to other paintings.</p>\r\n<p><strong>Aimee: So how do you know when you’re satisfied?</strong></p>\r\n<p><strong>David: </strong>Since I don’t spend a lot of time, I just go with my gut feeling. It either works or doesn’t.</p>\r\n<h4>PAINTING AS A PASTTIME</h4>\r\n<p><strong>Aimee: What do you enjoy most about abstract painting?</strong></p>\r\n<p><strong>David:</strong> I really enjoy the spontaneous effects that I can create with my brush strokes. Since I am not ‘boxed in’ to create an image, I feel that there is more freedom, more play and more ways to explore. As if I can just be myself. I like that.</p>\r\n<p><strong>Aimee: Would you recommend it as a pastime and if so, why?</strong></p>\r\n<p>David: That depends on your personality. I think it’s important that you can simply let go and be creative. Also, realize that it may or may not work every time. When it doesn’t work, just move on to the next time.</p>\r\n<p><strong>Aimee:</strong> Do you think you have to have existing skills or innate qualities to be able to paint abstract?</p>\r\n<p></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645450271/richtext/nbv2vgpo6f4s3qniveml.jpg\" alt=\"emplo Mayor, 12 de Octubre\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>David:</strong> Good question. Some people have the knack for expressing themselves and some like to be more rigid. I am okay with that. When I taught watercolour, I had some people who preferred to be very realistic and others who loved the looseness and the accidents that happened. I tend to fall into the latter group but I always respect other points of view.</p>\r\n<p>My daughter, who is almost thirty, has autism. I take her to my studio where she loves to paint. She needs some prompting so I pick the colours and remind her to either get paint or water, but she seems to enjoy it. The result is abstraction. Some are better than others. What she thinks about them, I will never know, but she has been doing this for about seven years.</p>\r\n<h4>AND FINALLY…</h4>\r\n<p><strong>Aimee: What do you think makes an abstract painting good?</strong></p>\r\n<p><strong>David:</strong> That is an open-ended question. I can stand looking at a Motherwell, Rothko or de Kooning for a long time and yet someone else may not even blink at their artworks.Beauty is in the eye of the beholder.</p>\r\n<p><strong>Aimee: Is that the same as valuable or collectible?</strong></p>\r\n<p><strong>David:</strong> Motherwell, Rothko and de Kooning created paintings that in the 1950s caused an uproar. Some loved while others hated their works. They challenged conventions.  Some of their works shot up in value; some took longer. Seventy years on and they have all become very expensive artwork. Things do change but perhaps as artists, we need patience.</p>\r\n",
  "tags": "abstract art,abstract art blog,abstract artist,abstract painting,art blog,art inspired by literature,artist from Saskatchewan,Canadian art for sale,Canadian contemporary art,Canadian contemporary artist,Canadian fine art,Canadian visual art,Canadian wall art,Canadian watercolour paintings,Cervantes  contemporary art,David Cheney artist,European literature art  muralists,paintings inspired by books,Proust",
  "images": [
    {
      "public_id": "blogs/uxjm1dqqdvnbvryiyiey",
      "url": "https://res.cloudinary.com/marine-graphics/image/upload/v1645450380/blogs/uxjm1dqqdvnbvryiyiey.jpg",
      "thumb_id": "blogs/r5yfpfw1otko24hvvivn",
      "thumbUrl": "https://res.cloudinary.com/marine-graphics/image/upload/v1645450377/blogs/r5yfpfw1otko24hvvivn.jpg",
      "_id": {
        "$oid": "6213948c74e9919dfe2cb35a"
      }
    }
  ],
  "numOfComments": 0,
  "user": {
    "$oid": "61b7bae1939ff81896b8cd56"
  },
  "name": "Nick Dittmer",
  "visible": 1,
  "comments": [],
  "createdAt": {
    "$date": "2022-02-21T13:33:00.622Z"
  },
  "__v": 0
},{
  "_id": {
    "$oid": "621399eb74e9919dfe2cb390"
  },
  "title": "In conversation with Rachel Cadrin",
  "slug": "in-conversation-with-rachel-cadrin",
  "description": "<p>Since interviewing Abstract Art Canada’s founding artists, David Brooks and Jim Ulrich, we’ve been talking to artist and art therapist, Rachel Cadrin. We wanted to get her views on abstract art and to discover more about how her career has developed as an abstract artist and therapist.</p>\r\n<p><strong>Could you give your own interpretation of what abstract painting is?</strong></p>\r\n<p></p>\r\n<p style=\"text-align:right;\"></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645450865/richtext/k9t6wmrfbsxprmffney8.jpg\" alt=\"Rachel in her studio\" style=\"height: auto;width: 240px\"/></div>\r\n<p>I see abstract painting as pure expression. There may or may not be visible forms, however, it is about conveying a feeling rather than a specific message. I see my paintings as providing an invitation to the viewer to create their own story, their own narrative, and that is one of the most beautiful things about abstract art; the freedom it provides the audience with to discover their own story. I may have created the painting with a specific intention but my intention doesn’t matter, what matters is how the viewer perceives the piece and the freedom they have to do so. That is what I think is incredible about abstract art and makes abstract art, abstract art – the freedom of expression for the artist and viewer.</p>\r\n<h4>YOUR BACKGROUND</h4>\r\n<p><strong>When did you start painting and who or what inspired you to start?</strong></p>\r\n<p>I started painting very young. Some of my earliest memories are of sitting at the kitchen table, painting. It was a quiet and safe space just for me, it allowed me to process, and it was something I found really enjoyable. I was never inspired by anything other than an innate desire to create, and maybe a little to escape. The older I got and the more I learned, the more I was inspired by artists like Gerhard Richter, Irene Neal and Ad Reinhardt.</p>\r\n<h4><strong>YOUR PAINTING STYLE</strong></h4>\r\n<p><strong>Did you start your career in abstract or in a different style?</strong></p>\r\n<p>When I first started painting I was into realism but by the time I graduated high school I was fully painting abstract pieces. However, I was still drawing realism and still do to this day.</p>\r\n<p><strong>How would you describe your current style of painting?</strong></p>\r\n<p>I create abstract colour field pieces. The focus of my work is using colour to create a space and allowing the space to evoke a narrative or emotion for the viewer.</p>\r\n<p><strong>Has your style changed or developed over time?</strong></p>\r\n<p></p>\r\n<p style=\"text-align:left;\"></p>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645451133/richtext/lioovhbd2ywavi1rk4z7.jpg\" alt=\"Oil Painting 4\" style=\"height: auto;width: 240px\"/></div>\r\n<p>Oh yes, very much. I used to focus on creating realistic images with great attention paid to the detail. Now, I focus more on emotion, on feeling, and creating movement and space to the piece. My works today look entirely different from my works 10 years ago and I love that. Equally, I think my work in ten years’ time will look completely different than what I am doing now and I love that.</p>\r\n<h4>INSPIRATION</h4>\r\n<p><strong>Which artists inspire you?</strong></p>\r\n<p>To name a few: Gerhard Richter, Fabian Marcaccio, Dan Flavin, Arturo Herrera, Irene Neal, Joseph Drapell, Anne Low, Bram Bogart, Ad Reinhardt and Alexis Harding.</p>\r\n<p><strong>What else inspires you?</strong></p>\r\n<p>I get a lot of inspiration from music, I find creating to be a deeply emotional experience and that experience can be heightened by a song. Sometimes I will hear a song and know I need to create it as a visual art.</p>\r\n<p><strong>Where do you seek inspiration for a painting or does inspiration strike without warning?</strong></p>\r\n<p>I think the thing with inspiration is if you have to seek it out it is not really inspiration. Inspiration comes when we least expect it; it sort of swoops in without warning and we choose to engage with it or not.</p>\r\n<h4>YOUR CREATIVE PROCESS</h4>\r\n<p><strong>Are there certain set stages for creating your paintings? For example, do you decide or know, in advance, the size of piece, if it’s going to be portrait or landscape, canvas or paper, and what materials you’re going to use?</strong></p>\r\n<p></p>\r\n<p style=\"text-align:left;\"></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645451281/richtext/rel65v52cazzosf9cwcq.jpg\" alt=\"Strictly Outta Curiosity\" style=\"height: auto;width: 240px\"/></div>\r\n<p>I primarily work in a square format, the only time I deviate from this is when I am working on a commissioned piece and the person commissioning it has specified different dimensions. I also always work with oil paint as I love the vibrant colour and richness of it. I happily work on canvas, however, my ‘go to’ is panel board. In summary, I always use the same materials but it’s the way that I use them that varies.</p>\r\n<p><strong>What is the first step?</strong></p>\r\n<p>Preparing the support (canvas or panel board). I work with a lot of texture so I start laying the texture and priming the support with Gesso to create a landing space for the art.</p>\r\n<p><strong>Do you always paint in the same place?</strong></p>\r\n<p>Yes. I have a little studio at home. Because a lot of what I use is toxic, I only create in my studio with proper ventilation and a respirator.</p>\r\n<p><strong>How long does a painting take? Or does it vary a lot?</strong></p>\r\n<p>It really varies and it depends a lot on size. Bigger pieces usually take quite a bit longer but depending on how much texture I work into a smaller piece they can take quite a long time too. I will usually paint for a day, take a day away, then come back and paint, then take more time away and so on, until I decide the piece is complete.</p>\r\n<p><strong>How do you know when you’ve finished a piece? Do you ever go back over it and change it to ‘correct’ it?</strong></p>\r\n<p></p>\r\n<p style=\"text-align:left;\"></p>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645451447/richtext/jq1tpgue09mrzjgk9j82.jpg\" alt=\"Oil Painting 5 on your wall\" style=\"height: auto;width: 240px\"/></div>\r\n<p>There is never anything to correct; what happens was meant to happen. I feel when they are done, I take time away from them and then I sit with them and really look at them. If it feels like something more needs to happen then I go back in, if it feels complete then I walk away.</p>\r\n<p><strong>What makes you satisfied with a piece and/or how do you know when you’re satisfied?</strong></p>\r\n<p>I am satisfied when they feel complete, and truthfully, I have some pieces I am not satisfied with and that is fine too. It is not about me being satisfied, it is about the work being what it needs to be.</p>\r\n<p><strong>Is there a ‘right way up’ to an abstract painting?</strong></p>\r\n<p>For my work, no. Other artists may have a different answer. I paint in a square and sign the back of the work so it can be hung in any orientation.</p>\r\n<h4>PAINTING AS A PASTIME</h4>\r\n<p><strong>What do you enjoy most about abstract painting?</strong></p>\r\n<p>The freedom of it, the release it provides, and being able to create something feels fantastic.</p>\r\n<p><strong>Would you recommend it as a pastime?</strong></p>\r\n<p>Yes, I would. I think painting provides you access into yourself. Emotions arise and you notice them and maybe you put them into the work or maybe you fixate on them or maybe you allow them to pass. I think it’s a nice way to spend some time. You get to simply be and at the end of it you have an artwork that you can put up on your wall or give to someone, or burn, it’s up to you.</p>\r\n<p><strong>Do you think you have to be a particular type of person to be able to paint abstract?</strong></p>\r\n<p></p>\r\n<p style=\"text-align:right;\"></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645451621/richtext/lskyccthswm3xr8cddpx.jpg\" alt=\"In the Midnight Hour\" style=\"height: auto;width: 240px\"/></div>\r\n<p>I think you have to be a person who is interested in creating. If you aren’t then you may not enjoy painting. I think often people will talk themselves out of doing something so that they can stay in their safe zone, and when that happens I think we need to take a long look at why we are fighting to stay in that safe zone. Abstract art, or really art in general, is about creating, it is about expressing. The only skill I think one needs is a comfort with expressing.</p>\r\n<h4>ART THERAPY</h4>\r\n<p><strong>You’re also an art therapist – can you tell us a bit about what that is?</strong></p>\r\n<p>Art therapy uses different art approaches to support people in releasing stuck, emotions, experiences, and behaviour patterns. Through the use of art, we become aware of all aspects of ourselves, we become aware of the narrative we have created and adhere to, and we become aware of how we may shift our narrative to redirect our life in the direction we choose for it. A lot of self-realization happens through the act of creating. The act of creating shines a light on our unconscious and allows us to tap into the deepest parts of ourselves. Witnessing a person’s journey through art therapy is truly beautiful and a privilege.</p>\r\n<p><strong>When did you decide to become an art therapist and what started you on that journey?</strong></p>\r\n<p>I was in my third year of my degree and I had to do a practicum, I decided to explore art therapy as I have always wanted to support people and I was having so many positive experiences with art myself. I completed the practicum and continued to volunteer at my work placement for years. Once I graduated I went on to pursue an education in Counselling and Art Therapy.</p>\r\n<p><strong>What are the benefits of art therapy?</strong></p>\r\n<p>Art therapy provides the space for people to really explore themselves and to release trauma in a safe and effective manner. Art therapy allows for people to tell their story without getting stuck in it. It provides insight into the inner working of one’s psyche and insight into why we do what we do. This insight provides us with the opportunity to notice how we want to shift our lives to better support us on our journey.</p>\r\n<h4>AND FINALLY…</h4>\r\n<p><strong>What do you think makes an abstract painting good?</strong></p>\r\n<p>Good is a relative term. I do not think one thing makes an abstract painting good or bad. I am drawn to certain paintings as some people are drawn to my work and others are not. However, that does not make my work good or bad, it’s just a person’s perception of it. Art is subjective. It can never be good or bad, you either like it based on your preconceived notions or you don’t. I can like an artwork, but that has nothing to do with whether it is good or bad, it is simply my taste. I think the thing that is important to remember too is you are not your artwork, people will love your art and people will hate your art but their reaction to your art is not a reflection of you.</p>\r\n",
  "tags": " abstract art,abstract art blog,abstract artist,abstract painting,art blog,art therapist,art therapy,artist from Canada,Canadian canvas art,Canadian contemporary art,Canadian contemporary artist,Canadian wall art,canvas art for sale,color field painting,colour field painting,contemporary art,fine art  Rachel Cadrin,trauma therapy,visual art",
  "images": [
    {
      "public_id": "blogs/jqsae86w9sbkkluk8nn7",
      "url": "https://res.cloudinary.com/marine-graphics/image/upload/v1645451755/blogs/jqsae86w9sbkkluk8nn7.jpg",
      "thumb_id": "blogs/rojpsxvjndwkyehndms7",
      "thumbUrl": "https://res.cloudinary.com/marine-graphics/image/upload/v1645451753/blogs/rojpsxvjndwkyehndms7.jpg",
      "_id": {
        "$oid": "621399eb74e9919dfe2cb391"
      }
    }
  ],
  "numOfComments": 0,
  "user": {
    "$oid": "61b7bae1939ff81896b8cd56"
  },
  "name": "Nick Dittmer",
  "visible": 1,
  "comments": [],
  "createdAt": {
    "$date": "2022-02-21T13:55:55.358Z"
  },
  "__v": 0
},{
  "_id": {
    "$oid": "6213a19a74e9919dfe2cba50"
  },
  "title": "In Conversation with Quentin Caron",
  "slug": "in-conversation-with-quentin-caron",
  "description": "<p>Since interviewing Abstract Art Canada’s founding artists, David Brooks and Jim Ulrich, we’ve been talking to artist, Quentin Caron. We wanted to get his views on abstract art and to discover more about how his career as an Imagineer has shaped his work as an abstract artist.</p>\r\n<p><strong>Aimee: When and who or what inspired you to start painting?</strong></p>\r\n<p></p>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645452911/richtext/svpd1szjbu9euqgecujm.jpg\" alt=\"Quentin in his workshop\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>Quentin:</strong> I still remember at age six telling my parents that I wanted to be a ‘drawer’ when I grew up. Their response was: “Oh, you mean an artist. Well, you can’t make a living at that! An architect draws and makes a living though.” My response to this was “okay then I will be an architect and do art.”I continued with art and when it came time to go to university a family friend suggested that I at least do foundation year at the local art college as this would make me a better architect. I applied, was accepted, and never looked back. Ironically, I ended up working on the creation of built environments over the next years.</p>\r\n<p><strong>Aimee: Has your style always been abstract?</strong></p>\r\n<p><strong>Quentin:</strong> Like many artists I have had phases; some more figurative than others. Early on, when I was handled by galleries in Canada, my work was a kind of associative abstraction combining figurative elements and personal iconography.In addition to painting abstracts I also draw and paint figures and portraits as a means to keep up certain artistic skills. When designing for aquariums, landscapes, or attractions, I have had to illustrate ideas and methodologies, as needed, and when carving emulations of geology or buildings then those are realistic renditions of what is required.</p>\r\n<p><strong>Aimee: How would you describe your style of art?</strong></p>\r\n<p><strong>Quentin:</strong> For years I described my work as visual poems and as more lyrical elements, (flowing lines and shapes, counterpoints of color, and so on), started to become dominant, I started to refer to them as visual songs.They do not represent poems or songs specifically, rather they are constructed in a similar way and with a similar intent; to affect the viewer emotionally and as much as possible in a positive way without being saccharine.</p>\r\n<p><strong>Aimee: Has your style changed or developed over time?</strong></p>\r\n<p><strong>Quentin: </strong>All artists change over time and so naturally I have changed and correspondingly, my work has also grown and evolved.</p>\r\n<p></p>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645453111/richtext/bknnsp85wgx154prwuou.jpg\" alt=\"Songs-P2418_16\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>Aimee: For those of us new to the world of abstract art, could you give your own interpretation of what abstract painting is?</strong></p>\r\n<p><strong>Quentin:</strong> Pure abstract art for me is non-figurative primarily so the emotional content of the work is not referential to objects, things, people, places, history, or to the life we lead. However, there are many iterations of less pure abstract art that does utilize references, either overtly or discreetly, and as long as it is honest and evocative, I am happy to enjoy it, or contribute to it.</p>\r\n<p><strong>Aimee: Which artists inspire you?</strong></p>\r\n<p><strong>Quentin:</strong> There are so many great artists and I am inspired by the honesty that they bring to their vision. For example, one day I may reconnect with Giovanni Bellini, and the next with Giacometti, then Francis Bacon… Oh wait, there’s Cezanne too, but what about Rothko or Lichtenstein or Bourgeios or Clemente or Matisse, and of course Picasso or Leonardo? There are also artists who I know personally like my friends Evan Penny or Jackie Winsor who I knew when living in New York, and ones whose studios I visited like Keith Haring or Noguchi. So ultimately, the act of creating and appreciating art is what inspires me.</p>\r\n<p><strong>Aimee: What else inspires you?</strong></p>\r\n<p><strong>Quentin:</strong> The living world is filled with inspiration. I grew up hiking in the Canadian Rockies and I love having all my senses engaged while enjoying a physical activity. The natural world is full of inspiration. Also, science, technology, history, film, literature… or just walking into a restaurant where odd pieces of conversation and gorgeous smells evoke memorable moments… These can feed the need to create.</p>\r\n<p>For many years I sculpted and/or designed artificial geologies for a variety of attractions including zoos (Asia Trail 1 at the National Zoo in Washington DC was a wonderful project) and aquariums (Aquario di Lisboa is my favourite still). I also designed other things and places like residences, fire halls, campuses and malls, etc. I used my creative mind for many wonderful projects. For several years I sculpted out of plaster creating faux geology or faux building facades for Walt Disney Imagineering in Orlando and then for Universal Creative in Orlando and then Beijing. At both organizations I inspired, and was inspired by, the teams I worked alongside.</p>\r\n<p></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645453252/richtext/cwsyhlqhjey9fi2hpatg.jpg\" alt=\"Songs-P1010_12\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>Aimee: Regarding your creative process, are you able to plan ahead or can inspiration strike without warning?</strong></p>\r\n<p><strong>Quentin: </strong>Creating art takes a moment when you make the first mark. This leads to a ‘conversation’ within the work, which ultimately requires resolution, be that at length, or quickly.</p>\r\n<p><strong>Aimee: Are there certain set stages? For example, do you decide in advance the size of piece, whether it’s going to be portrait or landscape, on canvas or paper, what media you’re going to use?</strong></p>\r\n<p><strong>Quentin:</strong> A studio should have a variety of options available. I have many sketchbooks, materials of all kinds, different sizes of canvases, panels, clay, and so on. Typically, when painting, I prepare a number of like-sized supports and then work through them. I’m often working on several different pieces at once, some of the same medium, some not. I will do quick sketches while working on pieces that have longer ‘conversations’ underway.</p>\r\n<p></p>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645453376/richtext/cnh2qxomtlwxkx2cyfsn.jpg\" alt=\"Quentin at work\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>Aimee: Do you always paint in the same place (a favourite place that’s a set studio)?</strong></p>\r\n<p><strong>Quentin:</strong> I have a studio (never large enough) where I do all my art.</p>\r\n<p><strong>Aimee: How long does a painting take or does it vary a lot?</strong></p>\r\n<p><strong>Quentin:</strong> There is a lot of variation regarding the time it takes. Like many artists there are times when an older painting needs additional work and so I may return to work on it over months or even years. Some pieces go quickly and others gestate over time.</p>\r\n<p><strong>Aimee: How do you know when you’ve finished a piece? Do you go back over it to change it or correct it?</strong></p>\r\n<p><strong>Quentin:</strong> No artist that I know ever is completely satisfied that a piece is what they want. However, there is a time when it is resolved and that helps the artist move on to the next one. Sometimes a work seems to need some addition or subtraction in order to improve it and so we all give in to that at times.</p>\r\n<p><strong>Aimee: So how do you know when you’re satisfied?</strong></p>\r\n<p><strong>Quentin: </strong>For me, when there is an emotional weight and unusual balance within the art, then it has been accomplished.</p>\r\n<p></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645453505/richtext/jvkqemcoqwho8dvudsky.jpg\" alt=\"The studio\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>Aimee: Is there always a ‘right way’ to an abstract painting?</strong></p>\r\n<p><strong>Quentin:</strong> All artists must be true to themselves in order to have honest works and so there can be no ‘right way’ since that would impose boundaries and expectations that don’t align with the artist.</p>\r\n<p><strong>Aimee: What do you enjoy most about abstract painting?</strong></p>\r\n<p><strong>Quentin:</strong> It is a wonderful challenge to create something that only relies on elements that are not experienced day to day and can affect the emotions, and imagination, of a viewer.</p>\r\n<p><strong>Aimee: Would you recommend it as a pastime and if so, why?</strong></p>\r\n<p><strong>Quentin:</strong> Yes, absolutely! Everyone should give creativity a chance and to use abstraction as a means of enriching one’s own life seems like a positive to me.</p>\r\n<p><strong>Aimee: Do you think you have to be a particular type of person, have existing skills or innate qualities to be able to paint abstract?</strong></p>\r\n<p><strong>Quentin:</strong> Anyone can do abstracts but for some overcoming the popular reinforcement to do and only appreciate figurative works can be difficult at first. Just learning to be free and open is one of the benefits of abstract art.</p>\r\n<p></p>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645453609/richtext/itolautdgegxsacsj13f.jpg\" alt=\"Songs-D3022_11\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>Aimee: What do you think makes an abstract painting good?</strong></p>\r\n<p><strong>Quentin: </strong>Honesty and emotional depth created from unrecognizable forms are what make abstract painting special.</p>\r\n<p><strong>Aimee: Is that the same as valuable or collectible?</strong></p>\r\n<p><strong>Quentin:</strong> Value in art is typically an intangible until those collecting it value the level of integrity and individuality that an artist expresses in the work, then having something special gains value.</p>\r\n<p>You can view Quentin’s art for sale through his gallery here.</p>\r\n<p></p>\r\n<img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645453665/richtext/gqyieydqpzjjl3ecxmgl.jpg\" alt=\"Songs-20x20-2018_25s\" style=\"height: auto;width: 240px\"/>\r\n<p></p>\r\n<p></p>\r\n",
  "tags": "abstract art,abstract art blog,abstract artist,abstract artist Florida,abstract painting,art blog,artificial geology,artist blog,artist from Canada,associative abstraction,Canadian artist,contemporary art,contemporary artist,Disney art,faux geology,figurative art,fine art,geology,geology art,iconography,imagineer,lyrical art,Universal studios art,visual art",
  "images": [
    {
      "public_id": "blogs/crvztnga7td5fahbpitg",
      "url": "https://res.cloudinary.com/marine-graphics/image/upload/v1645453722/blogs/crvztnga7td5fahbpitg.jpg",
      "thumb_id": "blogs/wzblkalpkgye2aogetoe",
      "thumbUrl": "https://res.cloudinary.com/marine-graphics/image/upload/v1645453720/blogs/wzblkalpkgye2aogetoe.jpg",
      "_id": {
        "$oid": "6213a19a74e9919dfe2cba51"
      }
    }
  ],
  "numOfComments": 0,
  "user": {
    "$oid": "61b7bae1939ff81896b8cd56"
  },
  "name": "Nick Dittmer",
  "visible": 1,
  "comments": [],
  "createdAt": {
    "$date": "2022-02-21T14:28:42.455Z"
  },
  "__v": 0
},{
  "_id": {
    "$oid": "6213a41774e9919dfe2cbc49"
  },
  "title": "Norman Sjoman on Art: a Revelation that should bring Astonishment and Enlightenment",
  "slug": "norman-sjoman-on-art-a-revelation-that-should-bring-astonishment-and-enlightenment",
  "description": "<p>To mark the launch of Abstract Art Canada, we heard from its founders, artists David Brooks and Jim Ulrich. Now we’d like to introduce artist Norman Sjoman. A student of Sanskrit and Yoga, Norman has written books, articles and catalogues on Yoga and Art.</p>\r\n<p>I have always been interested in artistic expression even as a child.  I grew up in rural Canada where there was no art. There were scarcely any books except comic books and the Simpson’s and Eaton’s catalogues. Subsequently, I was stimulated and educated by the music of the Sixties. Bob Dylan was at the forefront as an icon for many young people like me.</p>\r\n<p>Choosing to study Sanskrit, I began my studies in Sweden. However, I was initially unaware that it was an Indian language. Eventually though, I moved to India to continue my Sanskrit education and it was there that I began restoring traditional Mysore paintings (Traditional Paintings of Karnataka) alongside my studies. Falling in love with India, I remained immersed there in its traditional culture for more than 25 years.</p>\r\n<h4>ABSTRACT ART AND SPIRITUALITY</h4>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645454145/richtext/eyazgeh3hoofqt3hurpv.jpg\" alt=\"Dimensional-Shift\" style=\"height: auto;width: 240px\"/></div>\r\n<p>I liked the format of the Mysore paintings – a story configuration or a figure framed. Each painting was primarily a sacred icon with figuration, decoration and abstraction; similar to that seen in tantric artwork.  According to Maurice Tuchman in his work The Spiritual in Art: Abstract Painting 1890-1985, abstract work has origins in spirituality. We have seen this most commonly through the Theosophical Society, which inspired many abstract artists.</p>\r\n<p>I believe that figurative or representational work is, in essence, abstract. As an artist, I am fitting a multidimensional scenario into a two-dimensional space. Similarly, early Chinese artists brought diverse elements together to give a multidimensional richness to a work of art.</p>\r\n<h4>A TEMPORARY EXPERIENCE OF ENLIGHTENMENT</h4>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645454235/richtext/wmruwlcanmhdlywtg8ko.jpg\" alt=\"Rudra Barred\" style=\"height: auto;width: 240px\"/></div>\r\n<p>I am fascinated by the Indian aesthetic theories all of which deal with revelation.  According to the aesthetic theory of dhvani which is translated as ‘suggestion’ or ‘revelation’, a piece of art should leave you in some form of astonishment. It should allow you to escape the confines of your own mind for a moment – a temporary experience of enlightenment. Art brings this about by stimulating your emotions until they universalize or transcend your mind.  Those emotions are aroused by a whole sense of things – colour, balance, a runaway line – all of which combine to turn the work into something else independent of them which concludes in the experience or revelation, awe or astonishment.</p>\r\n<p>There are theories, however, that art is a representation of the confines of our own mind in the space-time continuum.  To evade that, we are faced with the problem of making something out of nothing – a nothing that is a projection of that same space-time. Feel reassured that serious meditators face the same problem.</p>\r\n<p>CREATIVITY IS THE VITAL COMPONENT</p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645454306/richtext/zvifukgkoj82ggm9zdka.jpg\" alt=\"Blue Light\" style=\"height: auto;width: 240px\"/></div>\r\n<p>However we choose to view it, creativity seems to be the vital component producing that aesthetic experience or rapture.  The word creativity itself is loaded in western culture from biblical mythology – but it is etymologically sourced to the Sanskrit root ‘kr’ which means to make or do.</p>\r\n<p>Coming full circle now and returning to North America. There was a rumour that the indigenous people of Canada would find themselves through their art, and that does seem to hold true.</p>\r\n<p>A work of art can last for hundreds of years and is treasured or worshipped beyond the life of its maker. It becomes a record of the soul of its maker and those who become its custodian.</p>\r\n<p>Musician and author Antonio Michael Downing, was born in Trinidad but raised from age 11 in rural Ontario. In his memoir, Saga Boy: My Life of Blackness and Becoming, he gave us his slant on creativity, describing it as “that desperate act of survival … Nature’s only gift.”</p>\r\n<p>What more needs to be said?</p>\r\n<p>In addition to his works found in private collections around the world, a selection of Norman’s art is for sale here at Abstract Art Canada.</p>\r\n<p>At Abstract Art Canada we sell original paintings by established and new artists. All our artists are global citizens originally from or with a connection to Canada.</p>\r\n",
  "tags": "abstract art,aesthetic  Canadian abstract art,Canadian abstract art for sale,Canadian art,contemporary art,enlightenment,fine art,India-inspired art,Indian art,meaning of art,Mysore paintings,origins of art,revelation,Sanskrit,understanding art,yoga,yoga-inspired art",
  "images": [
    {
      "public_id": "blogs/dq0vu4tuwwiipefz6lmg",
      "url": "https://res.cloudinary.com/marine-graphics/image/upload/v1645454359/blogs/dq0vu4tuwwiipefz6lmg.jpg",
      "thumb_id": "blogs/ul2wgmuudjyp1snx8ocq",
      "thumbUrl": "https://res.cloudinary.com/marine-graphics/image/upload/v1645454356/blogs/ul2wgmuudjyp1snx8ocq.jpg",
      "_id": {
        "$oid": "6213a41774e9919dfe2cbc4a"
      }
    }
  ],
  "numOfComments": 0,
  "user": {
    "$oid": "61b7bae1939ff81896b8cd56"
  },
  "name": "Nick Dittmer",
  "visible": 1,
  "comments": [],
  "createdAt": {
    "$date": "2022-02-21T14:39:19.475Z"
  },
  "__v": 0
},{
  "_id": {
    "$oid": "6213a8bf74e9919dfe2cbe5d"
  },
  "title": "Painted reflections on the Covid pandemic",
  "slug": "painted-reflections-on-the-covid-pandemic",
  "description": "<p></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645455452/richtext/gce6rglmwpav0nohwm5t.jpg\" alt=\"Jim Pandemic 1\" style=\"height: auto;width: 240px\"/></div>\r\n<p>A few months back, when the COVID pandemic was just starting to tear its way across the world,  Erratic Pictures film maker, Anna Cooley asked Abstract Art Canada artist and founder, Jim Ulrich, to take part in a project, Sandbox ii – a documentary on the psyche in transition in the time of COVID. Anna had observed that eight billion people had been forced into introversion and that this was nature’s call for change.</p>\r\n<p></p>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645455490/richtext/ujm9uu3v83ve6was6zct.jpg\" alt=\"Jim Pandemic 2\" style=\"height: auto;width: 240px\"/></div>\r\n<p>Anna asked Jim to create paintings inspired by his meditations on the journey of the COVID pandemic. Erratic Pictures asked seven other artists to do the same. Erratic Pictures turned the results into a sandbox: an interactive gallery of each of the artists’ painted stories.</p>\r\n<p>Anna hopes that these paintings will inspire us all to discover our own stories of our experiences of the pandemic.</p>\r\n<p>Listen to Jim talk about each of his three paintings (also pictured below). Jim takes you on a journey of how each composition represents his own, personal experience of COVID-19. He finishes with his final thoughts for the future.</p>\r\n<p>At Abstract Art Canada, we sell original abstract paintings by established and new artists. All our artists are global citizens originally from or with a connection to Canada. If you’d like to know more about Abstract Art Canada, click here.</p>\r\n<p></p>\r\n<img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645455536/richtext/pfzwucvo81ecvjgaxiig.jpg\" alt=\"Jim Pandemic 3\" style=\"height: auto;width: 240px\"/>\r\n<p></p>\r\n",
  "tags": " abstract art,abstract art blog,art therapy,contemporary art,Covid pandemic,Covid-19,global pandemic,introversion",
  "images": [
    {
      "public_id": "blogs/sjzpq46vvdrmmpeggsyl",
      "url": "https://res.cloudinary.com/marine-graphics/image/upload/v1645455552/blogs/sjzpq46vvdrmmpeggsyl.jpg",
      "thumb_id": "blogs/put7iivtyctyfltrxpff",
      "thumbUrl": "https://res.cloudinary.com/marine-graphics/image/upload/v1645455550/blogs/put7iivtyctyfltrxpff.jpg",
      "_id": {
        "$oid": "6213a8bf74e9919dfe2cbe5e"
      }
    }
  ],
  "numOfComments": 0,
  "user": {
    "$oid": "61b7bae1939ff81896b8cd56"
  },
  "name": "Nick Dittmer",
  "visible": 1,
  "comments": [],
  "createdAt": {
    "$date": "2022-02-21T14:59:11.935Z"
  },
  "__v": 0
},{
  "_id": {
    "$oid": "6213ab2874e9919dfe2cbe77"
  },
  "title": "Do we really feel better when we paint?",
  "slug": "do-we-really-feel-better-when-we-paint",
  "description": "<p>AT ABSTRACT ART CANADA, WE BELIEVE ABSOLUTELY, YES!</p>\r\n<p></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645455924/richtext/pwatt8tme5civwnortpc.jpg\" alt=\"Painting relieves stress!\" style=\"height: auto;width: 240px\"/></div>\r\n<p>According to the Institute for Health Metrics Evaluation (IHME)’s Global Burden of Disease, about 13% of the global population – some 971 million people – suffer from some kind of mental disorder. Also, one in four people will experience some sort of mental illness in any given year. The UK, for example, faces huge public health challenges with mental ill-health accounting for more than 20 per cent of these challenges – more than cancer and cardiovascular disease.</p>\r\n<p>However, creativity and the arts have been proven to have positive effects on the human psyche and, in turn, our mental and emotional health. Numerous studies show that both observing and creating art can reduce cortisol, the ‘stress hormone’.</p>\r\n<p>According to mentalhealth.org there is already widespread recognition of how great a role the arts could play in helping people to stay mentally healthy. This is both in the act of appreciation of the arts and as a participator in or creator of art.</p>\r\n<p>Harvard Medical School art therapist, Megan Carleton, highlights the beneficial effects of creating not being dependent on a person’s skills or talents but rather on the process of painting itself</p>\r\n<h4>AT NO OTHER TIME IN RECENT HISTORY HAS OUR MENTAL AND EMOTIONAL HEALTH NEEDED REVITALISING MORE.</h4>\r\n<p>2020 will always be remembered as the year of the COVID-19 pandemic.  As of July 2021, there were more than 185 million cases of COVID-19 worldwide, more than four million lives lost, and countless more left mentally and emotionally scarred by the effects of lockdown, enforced physical distancing, social isolation, muddled vaccination processes and, for some, loss of income, not to mention grief from the loss of loved ones to the virus itself.</p>\r\n<p>Early on in the pandemic, Director-General of UNESCO, Audrey Azoulay stated that ‘[art] brings us closer together than ever’.</p>\r\n<p></p>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645455988/richtext/esvcrod2pbk5g6bwb96h.jpg\" alt=\"Art gives us inner freedom\" style=\"height: auto;width: 240px\"/></div>\r\n<p>The pandemic forced the closure of cultural institutions, including art galleries worldwide. Nonetheless, the arts have remained resilient with many providers moving online and becoming increasingly accessible as the world locked down. People could view concerts, operas and plays from the comfort of their living rooms. Not only that, people started to crave participation in artistic activities. In the UK there were reports of an increase in demand for online art classes themselves.</p>\r\n<p>Professor and arts educator, Brittany Harker Martin, makes the case for the arts having a positive effect on mental health both in our home lives and in education settings.</p>\r\n<h4>SOCIAL PRESCRIBING</h4>\r\n<p>In the UK, ‘social prescribing’, where healthcare practitioners refer patients to community-based services such as art classes, was pioneered in the late 20th century. Since then, it has become a ‘go to’ for treating mental as well as physical ill-health for the last 20 years.</p>\r\n<p>Social prescribing has also been gaining traction around the world including in Australia, Singapore, parts of Europe and more recently, Canada, through the work of the Alliance for Healthier Communities</p>\r\n<p>Just as the pandemic was hitting global news channels, Kate Mulligan, Director of Policy and Communications at the Alliance for Healthier Communities, and Kavita Mehta, CEO of the Association of Family Health Teams of Ontario, wrote a piece extolling the virtues of weaving social prescribing into the tapestry of Canada’s healthcare system noting that Ontario is ‘poised and ready to scale up social prescribing’ after a pilot programme reported 90% of participating physicians observing that it has improved their clients’ health and wellbeing.</p>\r\n<p>It is clear though that many countries, including Canada, have a way to go before alternative therapies such as art therapy become readily available.</p>\r\n<h4>LEARN TO PAINT WITH ABSTRACT ART CANADA</h4>\r\n<p>At Abstract Art Canada, we believe passionately in the role that art and painting can play in improving our mental and emotional wellbeing. Whether you join us through a prescribed route or not, we are here to teach you the basics and to get you started on your artistic journey.</p>\r\n<p></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645456088/richtext/a2ctyzhytgse6unulkuj.jpg\" alt=\"Art takes all forms\" style=\"height: auto;width: 240px\"/></div>\r\n<p>Born in the UK, abstract artist and founder of Abstract Art Canada, David Brooks grew up in Canada and has spent his life in the US, the Middle East, and Asia. David has a natural gift for abstract painting but growing up as the son of psychiatrists, David has also had an insight into mental ill-health and how art can play a therapeutic role in people’s lives.</p>\r\n<p>Bringing the two areas together, David now feels the time is right to announce our plans to launch Abstract Art Canada’s online art classes. These virtual sessions will show how the mindfulness act of creating a painting has the potential to improve your mental or emotional wellbeing.</p>\r\n<p>The courses will be tailored to beginners and a package will also be made available for businesses seeking to boost the wellness of their workforce after a difficult time through COVID lockdown.</p>\r\n<p>“At Abstract Art Canada, we don’t claim to be psychotherapists but we do bring our experience as creators, educators and communicators. Through our own lived experiences our courses promise to be authentic and empathic as well as simple and engaging. Painting has been a lifesaver for me. I’m more at peace now than ever before. It’s my sincere hope that we can provide an outlet or even a lifeline to others.”</p>\r\n<p style=\"text-align:right;\">(David Brooks, Founder and Artist, Abstract Art Canada)</p>\r\n<p>At Abstract Art Canada, we sell original paintings by established and new artists. All our artists are global citizens originally from or with a connection to Canada.</p>\r\n<p>Please note that all users of Abstract Art Canada’s art classes are responsible for their own medical care, treatment and oversight. All content in our classes are for informational purposes only and does not constitute the providing of medical advice nor is it intended to be a substitute for independent professional medical judgement, advice, diagnosis or treatment.</p>\r\n<p></p>\r\n<img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645456158/richtext/nufivhd1jdp3clyzqfvs.jpg\" alt=\"Art is peaceful and relaxing\" style=\"height: auto;width: 240px\"/>\r\n<p></p>\r\n",
  "tags": "art lessons,art therapy,art tutorials,Covid,creative therapy,emotional health,global pandemic,impact on mental health,mental health  mindfulness,online art classes,painting lessons,social isolation,social prescribing",
  "images": [
    {
      "public_id": "blogs/hdqpixtsnwc9vcj6zawv",
      "url": "https://res.cloudinary.com/marine-graphics/image/upload/v1645456169/blogs/hdqpixtsnwc9vcj6zawv.jpg",
      "thumb_id": "blogs/pwmmkfj7k4vnyw8jw2gq",
      "thumbUrl": "https://res.cloudinary.com/marine-graphics/image/upload/v1645456167/blogs/pwmmkfj7k4vnyw8jw2gq.jpg",
      "_id": {
        "$oid": "6213ab2874e9919dfe2cbe78"
      }
    }
  ],
  "numOfComments": 0,
  "user": {
    "$oid": "61b7bae1939ff81896b8cd56"
  },
  "name": "Nick Dittmer",
  "visible": 1,
  "comments": [],
  "createdAt": {
    "$date": "2022-02-21T15:09:28.523Z"
  },
  "__v": 0
},{
  "_id": {
    "$oid": "6213ae6974e9919dfe2cbe8d"
  },
  "title": "In conversation with artist Jim Ulrich",
  "slug": "in-conversation-with-artist-jim-ulrich",
  "description": "<p>Following on from our interview with Abstract Art Canada’s founding artist, David Brooks, we spoke to co-founder and artist, Jim Ulrich, to find out more about his long career as an abstract painter and to get his views on abstract art.</p>\r\n<p><strong>Aimee: When, who or what inspired you to start painting?</strong></p>\r\n<p><strong>Jim:</strong> I was born in Lethbridge, near Calgary in Alberta, raised on a farm in southern Alberta and came to Calgary to work. The company who I worked for put me in the advertising department so I was sent to night classes at the local art school but I actually started pursuing art formally as an undergraduate at Eastern Washington University.</p>\r\n<p><strong>Aimee: Did you start off in abstract or in a different style?</strong></p>\r\n<p><strong>Jim:</strong> I didn’t really start in a specific style; I covered a broad range of styles in my studies at university. The styles I’d follow would have a lot to do with my teaching professor at the time.</p>\r\n<p><strong>Aimee: How would you describe your current style of painting?</strong></p>\r\n<p><strong>Jim:</strong> I use abstract images but I also use representational as well. My paintings look pure abstract but it depends on the work. I’ve moved through a lot of different periods. You could describe me as an abstract painter but contemporary painter might be a better description. Sometimes I paint from photos, sometimes I paint in the outdoors. Either way, it all evolves into an abstract style.</p>\r\n<p></p>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645456689/richtext/dsapyqsykwrouqhovzjz.jpg\" alt=\"Jim in his Studio\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>Aimee: Has your style changed or developed over time?</strong></p>\r\n<p><strong>Jim:</strong> Yes, my style has developed according to how my interests have developed and also how I’ve grown as an artist.  Even now, I think my style is still developing. I look for new things – breakthroughs in my work – I continually try to challenge myself.  That said, I think it’s important to settle into what you want to do and to be true to yourself rather than continually hopping styles.</p>\r\n<p><strong>Aimee: Which artists inspire you?</strong></p>\r\n<p><strong>Jim:</strong> There are so many. I started my career in the sixties at the tail end of abstract expressionism. Americans such as Jackson Pollock and Clyfford Still were big influences. Also pop art: Warhol, and his imagery taken from advertising campaigns. Chinese ink paintings have also influenced my art. Then there was conceptual art of the seventies: Piero Manzoni’s Artist’s Shit, for example. For me at this time, I was particularly inspired by the German contemporary artist, Gerhard Richter, and the American graphic artist, Robert Rauschenberg. In 1975, when studying in San Francisco, I saw Rauschenberg’s Retrospective and it changed my whole perspective on art. It was outrageous but it opened the door to what art could be.</p>\r\n<p></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645456741/richtext/esn3g7mvhdjnjxdlvg6s.jpg\" alt=\"Working in Australia\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>Aimee: Where do you seek inspiration or does inspiration ‘strike’ without warning?</strong></p>\r\n<p><strong>Jim:</strong> I think often it’s more about perspiration than inspiration.</p>\r\n<p>Sometimes an experience can inspire my work. For example, when I was traveling in Australia, I read about a young woman, Kate McQuarrie, who was killed by a crocodile in the Gulf of Carpentaria so I painted a series of paintings ‘Homage to Miss Kate’ which was inspired by the story.</p>\r\n<p><strong>Aimee: Do you always paint in the same place?</strong></p>\r\n<p><strong>Jim:</strong> I have two studios: one in Alberta and one in Thailand. I struggle with Canadian winters so I generally spend those coldest months in Thailand.</p>\r\n<p></p>\r\n<div style=\"text-align:left;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645456818/richtext/zwns0c8f3n1wyv5zl1oa.jpg\" alt=\"Jim's Studio in Alberta\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>Aimee: Take me through your process: What is the first step? Are there certain set stages?</strong></p>\r\n<p><strong>Jim: </strong>I try to work every day or I’d get lazy. You have to set the conditions so I come out to my studio, I have my coffee and then either I carry on with a painting I’ve already started or start something new. When starting a new painting, there is always a lot of planning, stretching canvases, some early drawings and painting. From there I start to develop some ideas that I want to go with. Sometimes I work on the floor: I pour paint onto plastic then manipulate it until I’ve got some sort of pattern. Then I pour on some acrylic paint and I add the canvas which when I peel it off reveals a really interesting print. It’s more like hydraulics than painting.</p>\r\n<p>I love the concept of pareidolia: seeing an image in an image. You allow your imagination to live and then allow improvisation to take over. This really has a place in my style of art.</p>\r\n<p><strong>Aimee: How long does a painting take or does it vary a lot?</strong></p>\r\n<p><strong>Jim:</strong> I work mainly in acrylics because they dry quicker than oils. Overall though, it’s impossible to say how long a painting takes as I work on a few at a time and I work until the painting is finished.</p>\r\n<p>Aimee: How do you know when you’ve finished a piece? Do you go back over it and change it?</p>\r\n<p><strong>Jim:</strong> It’s an intuitive thing. You look at it and you know there’s nothing else you want to do to it. If you have more ideas then that’s for a new painting. The only time this doesn’t apply is if I’m working on a series of paintings on a particular theme and I might work on them one at a time or work on them simultaneously .</p>\r\n<p><strong>Aimee: Is there a ‘right way up’ to an abstract painting?</strong></p>\r\n<p><strong>Jim:</strong> I have a pretty good idea of how I want the painting. However, my wife sometimes comes into the studio and tells me to turn a painting up the other way. I listen to her because she has a good eye. We often collaborate. Also, if a buyer wants to put it a different way around then I don’t mind. This isn’t a universal approach though: German neo-expressionist painter Georg Baselitz painted many of his works upside down, deliberately. They are worth millions. If you bought one, could you turn it right side up? Of course – but it’d sure ruin a Baselitz.</p>\r\n<p><strong>Aimee: What do you enjoy most about abstract painting?</strong></p>\r\n<p><strong>Jim:</strong> I love the freedom it brings. The openness. I can do anything I want. Art is my life. I’m always looking for new things and new experiences that I can use in my work.</p>\r\n<p></p>\r\n<div style=\"text-align:right;\"><img src=\"https://res.cloudinary.com/marine-graphics/image/upload/v1645456921/richtext/udzziijs0oeygmwklsqp.jpg\" alt=\"Tools of the trade\" style=\"height: auto;width: 240px\"/></div>\r\n<p><strong>Aimee: Would you recommend taking up abstract painting?</strong></p>\r\n<p>Jim: Yes. Just have a go! You’ll never know if you’re going to enjoy it until you try. You have to build the skills first though. Mix some colours, learn what the paints can do. Try different tools. Gerhard Richter paints with a giant Squeegee. Or you can just use your hands. Thousands of years ago, Australian Aboriginals were blowing paint from their mouths through their hands. This is probably the first example of airbrush and stencil.</p>\r\n<p><strong>Aimee: Do you think you have to have any innate qualities or skills to be able to paint abstract?</strong></p>\r\n<p><strong>Jim:</strong> No. It’s harder to do realism than abstraction. For abstract, you just need to have courage and curiosity.</p>\r\n<p><strong>Aimee: What do you think makes an abstract painting good?</strong></p>\r\n<p><strong>Jim:</strong> Art critics and art historians look for roots and connections. They try to tie art into another world and to create labels. They try to tell you what to like but I think good art comes down to taste and uniqueness. You learn a lot about art by looking at art and by being sensitive to what you’re looking at.</p>\r\n<p>You can view Jim’s gallery of paintings here and find out more about our courses here.</p>\r\n",
  "tags": "abstract art,abstract art blog,abstract painting,art  art blog,artist,contemporary art,expressionist art,interview with artist,learning to paint abstract",
  "images": [
    {
      "public_id": "blogs/nkwqkeqhr7x6wqn8zndh",
      "url": "https://res.cloudinary.com/marine-graphics/image/upload/v1645457001/blogs/nkwqkeqhr7x6wqn8zndh.jpg",
      "thumb_id": "blogs/hbi3yjdzvmo4xrfcqlnt",
      "thumbUrl": "https://res.cloudinary.com/marine-graphics/image/upload/v1645456998/blogs/hbi3yjdzvmo4xrfcqlnt.jpg",
      "_id": {
        "$oid": "6213ae6974e9919dfe2cbe8e"
      }
    }
  ],
  "numOfComments": 0,
  "user": {
    "$oid": "61b7bae1939ff81896b8cd56"
  },
  "name": "Nick Dittmer",
  "visible": 1,
  "comments": [],
  "createdAt": {
    "$date": "2022-02-21T15:23:21.275Z"
  },
  "__v": 0
},{
  "_id": {
    "$oid": "6213b08974e9919dfe2cbeba"
  },
  "title": "In conversation with artist David Brooks",
  "slug": "in-conversation-with-artist-david-brooks",
  "description": "<p>To mark the launch of Abstract Art Canada, we’ve taken the opportunity to interview Production &amp; Marketing Director and Founding Artist, David Brooks, to get his take on abstract art and to find out about his own experiences of painting.</p>\r\n<p><strong>Aimee: When and why did you start painting?</strong></p>\r\n<p><strong>David:</strong> I started about three years ago back in 2018. I was looking for a creative outlet. My job as a programmer has a creative element to it but I wanted something where I could create more from myself, at a deeper level. I though why not just give it a try so I bought some supplies and gave it a shot.  It was just luck that it turned out to be something that I enjoyed.</p>\r\n<p><strong>Aimee: Did you start off in abstract or in a different style?</strong></p>\r\n<p><strong>David:</strong> I started off trying to paint actual things – the face of a monkey, for example – but the end result was a bit frightening. Then I tried to paint abstract landscapes which I found quite easy – blending paints. There have been times when I’ve painted in realism but generally my style is expressionist and you can more or less tell what the subject is.</p>\r\n<p><strong>Aimee: How would you describe your style of painting?</strong></p>\r\n<p>D<strong>avid:</strong> I paint in abstract expressionism.</p>\r\n<p><strong>Aimee: Has your style changed or developed over time?</strong></p>\r\n<p><strong>David:</strong> Yes, it’s matured through experience and a determination to keep at it. When I first started, I was less able to be expressive. I was concentrating on the delivery rather than the enjoyment of it. I’ve still got a long way to go. I’d like to be able to get to a point where I have something in my head and I can execute it exactly as I imagine it but that’s really hard to achieve. Generally, I start with an idea but by the end it could become something completely different.</p>\r\n<p><strong>Aimee: For those of us new to the world of abstract art, could you give your own interpretation of what abstract painting is?</strong></p>\r\n<p><strong>David:</strong> It’s often described as contemporary art but that can include anything such as ethnically inspired art. I’d describe it as anything that’s not traditional or realistic in style.</p>\r\n<p><strong>Aimee: Which artists inspire you?</strong></p>\r\n<p><strong>David:</strong> I’ve drawn from ethnically inspired art, in this case, the Japanese artistic style of Katsushika Hokusai. I particularly like Hokusai’s use of colours.  I lived in Japan for four years and prior to that I had been visiting regularly over a period of more than 15 years so Japanese art has influenced my style.</p>\r\n<p>Another inspiration for me has been British artist, John Turner – the painter of light. I love the simplicity of his paintings; they are extremely elegant.</p>\r\n<p><strong>Aimee: Where do you seek inspiration or does inspiration strike without warning?</strong></p>\r\n<p><strong>David:</strong> Sometimes I will start with no plan and see how it goes and that can be interesting. Other times I’ll start with a bunch of paintings that I like to get ideas from. Or I’ll start with a photograph or an image from a film and I’ll snap a screenshot – this gives me ideas for colour suggestion.</p>\r\n<p><strong>Aimee: What is your preparation and process for starting a painting?</strong></p>\r\n<p><strong>David:</strong> I always paint on canvas. A canvas holds the paint in a much better way than paper does. Also, I always use acrylic paint. I start off by laying down a wash – a colour, any colour, not necessarily a primary colour. I also like to explore with collage, bringing in materials such as scrunched up toilet paper, to create different effects.</p>\r\n<p><strong>Aimee: Do you always paint in the same place?</strong></p>\r\n<p><strong>David:</strong> Yes, I have an area in my home office with an easel and a chair. The space has great light and it gets more and more paint spattered every day.</p>\r\n<p><strong>Aimee: How long does a painting take?</strong></p>\r\n<p><strong>David:</strong> I tend to start two or three at a time. They take about six hours each, over a few days.  I like to let a painting ‘bake’ for a bit and then review it with fresh eyes. A painting can look distorted if you’re viewing it at an angle. Also, different details are noticeable when painting at different distances away. I regularly review any painting I’m working on often by taking a high-resolution photo of it and then looking at it on my computer. I notice different details and get a much better idea of what it really looks like. Also, the canvases I use are more than a metre wide so you need to stand a long way back to be able to view it. With larger brushwork, bolder, more vivid colours are needed and you can’t really appreciate this when you have to stand close up.</p>\r\n<p><strong>Aimee: How do you know when you’ve finished a piece? Do you go back over it to change it or ‘correct’ it?</strong></p>\r\n<p><strong>David:</strong> After reviewing the painting on the computer, I’ll generally make a couple of adjustments and then ask artist friends for their views but I may just modify it anyway with more colour to really make it ‘pop’. There are times though when you can’t change it if you think you’ve made a mistake because of some of the effects that you might be using, for example, runny paint needs a clear seal to make sure the paint runs in a particular way. Usually I just battle on through and see what happens next.</p>\r\n<p><strong>Aimee: How do you know when you’re satisfied with a painting?</strong></p>\r\n<p><strong>David:</strong> With some of my paintings I’ve just thought that it’s ok, but then someone else has loved it and bought it. It’s a very personal thing. Sometimes people like a painting that you don’t expect them to like but this is an example of the viewer bringing their own interpretation to the painting.</p>\r\n<p><strong>Aimee: Is there a ‘right way up’ to an abstract painting?</strong></p>\r\n<p><strong>David:</strong> Good question! It depends how abstract it is. So, if it’s an abstract interpretation of something real such as a ship then of course there’s a ‘right way up’. But if it’s a purely abstract piece then it doesn’t matter.</p>\r\n<p><strong>Aimee: What do you enjoy most about abstract painting?</strong></p>\r\n<p><strong>David:</strong> I enjoy the creativity of it: playing with paint, the different effects, how you can produce something amazing without thinking about it and when you didn’t think you were capable of it. I like to think the painting was already there but I’m just discovering it, that there is some sort of Muse inspiring it.</p>\r\n<p><strong>Aimee: Would you recommend abstract painting as a hobby?</strong></p>\r\n<p><strong>David:</strong> Yes, absolutely! It’s an approachable and relaxing hobby and best of all it is mentally cleansing in a heavily digital world. It provides an opportunity to use the part of your brain that you wouldn’t use in a lot of jobs these days. Also, you can have something that’s finished in just a few hours and get an immediate sense of achievement. It’s nice to be able to produce something for your own wall, knowing that it’s completely unique and you’ve created it yourself.</p>\r\n<p><strong>Aimee: Do you think you have to be a particular type of person or have any innate qualities to be able to paint abstract?</strong></p>\r\n<p><strong>David:</strong> All you need is a mindset of ‘I’m going to enjoy this.’ There’s no right or wrong answer with abstract painting. I never took any art lessons. Just be willing to pick up a brush and give it a try. If you can mix two colours on a piece of canvas then you’ve already made your first piece of art. There are little tricks you can learn and follow and you can gain confidence in the process of it quite quickly. With abstract art it’s a constant learning process. You’re always trying to learn new skills but it’s enjoyable to look at the work of other artists to see how they did something and to try that for yourself.</p>\r\n<p><strong>Aimee: What do you think makes an abstract painting good?</strong></p>\r\n<p><strong>David: </strong>The uniqueness of the style and the composition. I think good abstract art should remind you of something – it should bring about a feeling of nostalgia: An experience, a book read, a beach visited, etc. A painting should be intrinsically good. Abstract art takes time to create.</p>\r\n<p>You can read more about David here and view his gallery here.</p>\r\n<p>COMING SOON… we’ll be talking to Abstract Art Canada’s Art Director and Abstract Artist and fellow Founder, Jim Ulrich, to get his insights into the world of abstract art.</p>\r\n<p>Stay tuned!</p>\r\n",
  "tags": "abstract art,abstract art blog,abstract painting,art,art,blog,artist,expressionist art,interview,learning to paint,abstract  painting",
  "images": [
    {
      "public_id": "blogs/zbxicgzc1epltpuov1ll",
      "url": "https://res.cloudinary.com/marine-graphics/image/upload/v1645457545/blogs/zbxicgzc1epltpuov1ll.jpg",
      "thumb_id": "blogs/vcp0atzzytdf47gsiswx",
      "thumbUrl": "https://res.cloudinary.com/marine-graphics/image/upload/v1645457543/blogs/vcp0atzzytdf47gsiswx.jpg",
      "_id": {
        "$oid": "6213b08974e9919dfe2cbebb"
      }
    }
  ],
  "numOfComments": 0,
  "user": {
    "$oid": "61b7bae1939ff81896b8cd56"
  },
  "name": "Nick Dittmer",
  "visible": 1,
  "comments": [],
  "createdAt": {
    "$date": "2022-02-21T15:32:25.450Z"
  },
  "__v": 0
}]